package com.example.cancare;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;


/**
 * A simple {@link Fragment} subclass.
 */
public class textFragment extends Fragment {

    String range[]={" \r الضغط الجزئي للأكسجين 75 - 100 mmHg \n " +
            "\r الضغط الجزئي لثاني أكسيد الكربون 38 - 42 mmHg \n" +
            " \r الدم الشرياني درجة الحموضة 7.38 - 7.42 \n" +
            " \r تشبع الأكسجين 94 - 100 \n" +
            " \r بيكربونات 22 - 28 mEq/L \n " +
            " \r قيمة الأكسجين أقل مع ارتفاع 3,000< قدم \n ",
            "\r الأمونيا 15-50 µmol/L \n" +
                    " \r سيرولوبلازمين 15-60 mg/dL \n" +
                    " \r كلوريد 95-105 mmol/L \n" +
                    " \r النحاس 70-150 µg/dL  \n" +
                    " \r الكرياتينين 0.8-1.3 mg/dL  \n" +
                    " \r نيتروجين اليوريا في الدم 8-21 mg/dL  \n" +

                    " \r الجلوكوز 65-110 mg/dL  \n" +
                    " \r الفسفور غير العضوي 1-1.5  mmol/L  \n" +
                    " \r الكالسيوم المتأين 1.03-1.23 mmol/L  \n" +
                    " \r المغنيسيوم 1.5-2 mEq/L  \n" +
                    " \r الفوسفات 0.8-1.5 mmol/L  \n" +
                    " \r البوتاسيوم 3.5-5 mmol/L  \n" +
                    " \r بيروفات 300-900 µg/dL  \n" +
                    " \r الصوديوم 135-145 mmol/L  \n" +
                    " \r الكالسيوم الكلي 2-2.6 mmol/L  \n" +
                    " \r إجمالي قدرة تجليد الحديد 45-85 µmol/L  \n" +

                    " \r نقل 200-350 mg/dL  \n " +
                    " \r اليوريا 1-2-3 mmol/L  \n " +
                    " \r حمض اليوريك 0.18 - 0.48 mmol/L  \n " +


            " \r الهيموغلوبين الغليكوزيلاتي 4٪ -6٪  \n" +
            " \r متوسط حجم الجسيم 80-100 fL  \n "  +
            " \r عرض توزيع خلايا الدم الحمراء  ( 11.5 ٪ 14.5 ٪(  \n " +
            " \r يعني الهيموغلوبين الحاد 0.4-0.5 fmol/cell  \n " +
            " \r متوسط تركيز الهيموغلوبين الحاد 30-35 g/dL  \n " +
            "\r  الشبكية 0.5٪ -1.5 ٪  \n "  +
            "\r خلايا الدم البيضاء 4-10 × 10 ^ 9 /L  \n" +
            "العدلات   2-8 × 10 ^ 9 / L \n" +
            "العصابات 1 × 10 ^ 9 / L \n" +
            "الخلايا اللمفاوية 1-4 × 10 ^ 9 / L \n" +
            "حيدات 0.2-0.8 × 10 ^ 9 / L \n" +
            "الحمضيات  0.5 × 10 ^ 9 / L \n" +
            "الصفائح الدموية150-400 × 10 ^ 9 / L \n" +
            "زمن البروثرومبين  11-14  ثانية \n" +
            "نسبة التطبيع الدولي 0.9-1.2 \n" +
            "تنشيط وقت التخثر الجزئي الجزئي 20-40 ثانية\n" +
            "الفيبرينوجين 1.8-4 جم/لتر\n" +
            "وقت النزيف: 2-9 دقائق \n","الدهون الثلاثية 50-150 mg/dL \n" +
            "الكوليسترول الكلي 3-5.5  mmol/L \n" +
            "البروتين الدهني عالي الكثافة 40-80 mg/dL \n" +
            "البروتين الدهني منخفض الكثافة 85-125 mg/dL \n",
            "الضغط الجزئي للأكسجين 75-100 mm Hg \n" +
            "تشبع الأكسجين 96 ٪ 100- ٪\n" +
            "الضغط الجزئي لثاني أكسيد الكربون 35-45 mm Hg \n" +
            "بيكربونات 18-22 mmol/L \n","الزلال 35-50 g/L \n" +
            "الفوسفاتيز القلوي 50-100 U/L \n" +
            "الأميليز 30-125 U/L \n" +

            "البيليروبين المباشر 0-6 µmol/L \n" +
            "غاما نقل الجلوتاميل 6-50 U/L \n" +
            "الليباز 10-150 U/L \n" +
            "البيليروبين الكلي 2-20 µmol/L \n" +

            "هرمون قشر الكظر 4.5-20  pmol/L \n" +
            "استراديول 1.5-5 ng/dL ذكور, أنثى مسامي 3.5 ng/dL \n" +
            "هرمون النمو 0-5 ng/mL \n" +
            "البروجسترون 70-280  ng/dL \n" +
            "البرولاكتين أقل من 14 ng/mL \n" +
            "التيستوستيرون (ذكور 10-25 nmol/L \n" +
            "الجلوبيولين المرتبط بالهروكسين 12-30 mg/L \n" +
            "هرمون منشط للغدة الدرقية 0.5-5 mIU/L \n","الفولات  المصل 7-36 nmol/L \n" +
            "فيتامين أ 30-65 µg/dL \n" +
            "فيتامين ب 130-700 ng/L \n" +
            "فيتامين ج 0.4-1.5 mg/dL \n" +
            "فيتامين د 5-75 ng/mL \n","ألفا بروتين جنيني 0-44 ng/mL \n" +
            " بيتا الإنسان موجهة الغدد التناسلية المشيمية 0-5 IU/I \n" +
            " مستضد سرطاني المنشأ 4 ug/L \n" +
            " حمض البروستاتا الفوسفاتيز 0-3 U/dL \n" +
            " مستضد خاص بالبروستاتا 4 ug/L \n","الكرياتين كيناز 25-200 U/L \n" +
            "الكرياتين كيناز ميغابايت 0-4 ng/mL \n" +
            "تروبونين0-0.4 ng/mL \n","ألفا 1 – انتيتريبسين 20-50 µmol/L \n" +
            "الانزيم المحول للأنجيوتنسين 23-57 U/L \n" +
            "بروتين سي التفاعلي 0-5 mg/L \n" +
            "مد ديمر 0-500 ng/mL \n" +
            "معدل ترسيب كرات الدم الحمراء أقل من 2 mm/hour \n" +
            "اللاكتات ديهيدروجينيز 50-150 U/L \n" +
            "الرصاص0-40 µg/dL \n" +
            "عامل الروماتويد0-25 IU/ml \n"

    };
    public textFragment() {
        // Required empty public constructor
    }

TextView ran;
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment

              View view=inflater.inflate(R.layout.fragment_text, container, false);
              ran=view.findViewById(R.id.ran);
              int index=getArguments().getInt("index1",0);
              ran.setText(range[index]);

        return view;
    }

}
